[{
        "price": "$599,995",
        "cdp": "Laurel Ridge - The Glen",
        "address": "2809 Iron Oak Court, Abingdon",
        "listing": "/listings/301386874764",
        "fulladdress": "2809 Iron Oak Court, Abingdon, MD 21009-1705",
        "description": "MOVE IN THIS SPRING!! PATTERSON MILL SCHOOLS! Brand new home located in the highly sought-after community of Laurel Ridge just minutes from I-95 and every convenience. Toll Brothers newest floor plan, the Fincastle - County Manor, is great for those who desire maximum utilization of space and enjoy entertaining. The main level boasts amazing 10' ceilings, private home office, sun drenched kitchen and breakfast area that flows directly into the great room. The large luxurious owners suite has a tray ceiling, two large walk-in closets, sumptuous over-sized semi-frameless shower with drying area and two separate vanities. Three large secondary bedrooms, all featuring walk-in closets, two additional bathrooms and laundry room complete the bedroom level providing the space and privacy everyone desires. Finished lower level rec. room and full bath.  Cul-de-sac location just steps from 2.3 miles of community nature trails, expansive hardwood floors, professionally selected finishes and gas fireplace are just a few attributes that make this home a MUST SEE! Call today! This one will not last long! Pictures are of a similar floor plan.  Move Into Your Dream Home Now with a 3.99% Rate (4.074% APR)**Based on 30 Yr. Fixed, $550,000 sale price, $385,000 loan amt. Minimum 30% down. Max rate lock is 100 days. Pmt. factor at 3.99% is $4.77 per $1,000 financed. Rate/program avail. through TBI Mortgage Company: NMLS #18154 (www.nmlsconsumeraccess.org): see tbimortgage.com for licensing info; subj. to change w/o notice and for qualified buyer only; other programs avail. Offers, incentives and seller contributions vary by community and are subj. to certain terms, conditions and restrictions. This is not an offering where prohibited by law. See sales representative for details. 3/19.  Equal Housing Lender.",
        "primarydetails": {
            "Beds/Baths": "4/4.1",
            "Interior Sq. Ft": "4,100",
            "Acreage": "0.27",
            "Age": "0",
            "Style": "Colonial",
            "MLS#": "MDHR201948",
            "Subdivision": "Laurel Ridge - The Glen",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$600,000",
        "cdp": "Heron Harbor",
        "address": "505 Concord Street #1Q, Havre De Grace",
        "listing": "/listings/300895508848",
        "fulladdress": "505 Concord Street #1Q, Havre De Grace, MD 21078-3564",
        "description": "PRICE REDUCED!     Stunning waterfront home on the Susquehanna River.  Uncompromised quality construction.  This was the Builders Model.  Patio has a tile floor and overlooks the river.  Great for a permanent home or vacation home.  Kitchen, dining and living rooms share a big open area all looking towards the river.  The roomy master bedroom with a huge master bath also shows a great view of the river.  Hardwood throughout, Crown molding everywhere!  All blinds and curtain rods stay.  Large TV in Family room stays.  Four ceiling fans, whole house sound system.  Extra shelving in all the closets and pantry.  There are cabinets and shelves in the laundry room.  All Kitchen cabinets have pull-out shelves.  Upgraded gas fireplace.  Merillat cabinetry, Silestone counter tops, upgraded GE appliances.    Spacious floor plan.  Security system with a view of the entry door (LCD screen in unit).  Andersen high performance windows.  HVAC replaced two years ago.  It has 8 years left on the 10 year service contract for a bi-annual service inspection.  One year HMS Warranty.",
        "primarydetails": {
            "Beds/Baths": "3/2.0",
            "Interior Sq. Ft": "2,240",
            "Acreage": "",
            "Age": "12",
            "Style": "Unit/Flat",
            "MLS#": "1009940102",
            "Subdivision": "Heron Harbor",
            "Design/Type": "Unit/Flat"
        }
    },
    {
        "price": "$615,000",
        "cdp": "Waverly Estates",
        "address": "2116 Waverly Drive, Bel Air",
        "listing": "/listings/300333495379",
        "fulladdress": "2116 Waverly Drive, Bel Air, MD 21015",
        "description": "SHORT SALE ~ GORGEOUS CUSTOM BUILT COLONIAL SITUATED ON 2.63 AC IN WAVERLY! THIS BEAUTY FEATURES A 2 STORY FOYER, FAMILY RM OFF GOURMET KIT, SUNRM, HUGE MASTER SUITE w/LUXURY OWNERS BATH, WIC & BONUS RM (POSSIBLE NURSERY OR 4TH BEDROOM)! A FULLY FINISHED BASEMENT w/BAR ROUGH-IN. GEOTHERMAL HEATING/COOLING SYSTEMS. COMMISSION PAID UPON FINAL SETTLEMENT.",
        "primarydetails": {
            "Beds/Baths": "4/3.1",
            "Interior Sq. Ft": "5,402",
            "Acreage": "2.63",
            "Age": "4",
            "Style": "Colonial",
            "MLS#": "1000249532",
            "Subdivision": "Waverly Estates",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$625,000",
        "cdp": null,
        "address": "906 Oriole Court, Bel Air",
        "listing": "/listings/301488002870",
        "fulladdress": "906 Oriole Court, Bel Air, MD 21015-4990",
        "description": "Brick Front Colonial on a 1.38 Acre Lot! This home features a two story Foyer & Family Room as well as Hardwood Floors and custom moldings throughout the Main Level. Gourmet Kitchen with Granite Countertops, Stainless Steel Appliances, Large Island, Pantry, Desk Area &  Breakfast Room that opens to huge Deck overlooking the woods! Family Room w/ Gas Fireplace and Ceiling Fan. Private Study and Laundry Room on main level. Impressive Master Bedroom Suite with Sitting Room, Master Bath with Soaking Tub, Walk-in Shower, dual vanities, & a Large 17'x16' Closet.  Absolutely a MUST SEE!",
        "primarydetails": {
            "Beds/Baths": "4/3.1",
            "Interior Sq. Ft": "3,974",
            "Acreage": "1.38",
            "Age": "13",
            "Style": "Colonial",
            "MLS#": "MDHR222052",
            "Subdivision": "None Available",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$599,990",
        "cdp": "Oakington Manor",
        "address": "824 Country Club Road, Havre De Grace",
        "listing": "/listings/300483569663",
        "fulladdress": "824 Country Club Road, Havre De Grace, MD 21078",
        "description": "On Swan Creek! Western red cedar log home combines rustic w/modern. Vaulted 2-story LR w/stone FP flows through stone columns to DR. Eat-in Kit, 1st floor MBR w/FP, Spa Ba, SteamRm & Sauna. 1st floor rooms access wraparound Deck. Lofted FamRm on 2nd level overlooks LR + BR2 w/FP, BR3 & Ba. Walk-out LL RecRm & Ba. Upper & lower Decks, ScreenedGazebo, 100ft dock, standby-generator. Private & serene!",
        "primarydetails": {
            "Beds/Baths": "3/3.1",
            "Interior Sq. Ft": "2,725",
            "Acreage": "0.86",
            "Age": "30",
            "Style": "Contemporary",
            "MLS#": "1002139850",
            "Subdivision": "Oakington Manor",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$623,990",
        "cdp": null,
        "address": "503 Tyrell Court, Bel Air",
        "listing": "/listings/300410673263",
        "fulladdress": "503 Tyrell Court, Bel Air, MD 21015",
        "description": "Welcome to the Covington Heritage! This home has a beautiful, open floorplan, featuring a Family Room with fireplace, Classic Kitchen, and Breakfast Area with sliding doors to the backyard. The Kitchen has an eat-in island, quartz countertops, and a large walk-in pantry. A study, formal dining room, powder room, and mud room with walk-in closet complete the first floor. Upstairs, there is a large Owner's Suite with dual walk-in closets and double doors leading into a luxurious Venetian Bath with freestanding tub and large tiled shower. The laundry room is conveniently located on the same floor, along with the additional 3 bedrooms, and a full bath with separate vanities. 3 car garage and unfinished basement for lots of storage. Price shown includes all applicable incentives when using a Keystone Custom Homes preferred lender. Price is subject to change without notice.",
        "primarydetails": {
            "Beds/Baths": "4/2.1",
            "Interior Sq. Ft": "3,389",
            "Acreage": "0.27",
            "Age": "1",
            "Style": "Other",
            "MLS#": "1001457544",
            "Subdivision": "None Available",
            "Design/Type": "Other"
        }
    },
    {
        "price": "$649,900",
        "cdp": "Timber Ridge",
        "address": "3109 Timber Ridge Circle, White Hall",
        "listing": "/listings/301108495564",
        "fulladdress": "3109 Timber Ridge Circle, White Hall, MD 21161-8983",
        "description": "Peaceful privacy awaits you in this stunning beauty, set on over 2.5 pastoral acres! You are welcomed inside by its elegant two-story entry foyer, flooded with natural light that complements the gleaming hardwood floors and uniquely curved staircase. Continue into the grand two-story family room, punctuated by a gas fireplace to keep you warm throughout the cooler months. An open concept design leads you into the adjacent kitchen, updated to include granite counters, stainless steel appliances, and abundant cabinet and counter space for easy meal prep.  You can find a butler's pantry off the kitchen and dining room.  An upper level landing gives way to four generously appointed bedrooms, including the grand owner's suite with its large room size and private owner's bath. The unfinished lower level is a large accommodating space, with walk-out access to the rear yard --ready for future expansion and flexibility! Boasting over 4,600 finished square feet with a three-car side garage, county trash pickup and snow removal, no HOA fees and peaceful cul-de -sac setting, this one truly has it all!  CONTACT ALT CO-LISTING AGENT for more information.  DIRECTIONS: From Route 23/Norrisville Rd. turn left onto Church Lane. Follow approx. 3/4 mile and stay right onto Duncan Road. Left on Long Corner Road approx. 1 mile to right onto Timber Ridge Circle to 3109 on left.  From I-83 take Route 439 exit to Route 23 North.",
        "primarydetails": {
            "Beds/Baths": "5/3.1",
            "Interior Sq. Ft": "6,891",
            "Acreage": "2.59",
            "Age": "12",
            "Style": "Traditional",
            "MLS#": "MDHR134410",
            "Subdivision": "Timber Ridge",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$629,900",
        "cdp": null,
        "address": "1034 Old Pylesville Road, Pylesville",
        "listing": "/listings/300874815524",
        "fulladdress": "1034 Old Pylesville Road, Pylesville, MD 21132-1421",
        "description": "This is YOUR dream home! If you're in to hosting summer bashes or holiday parties - you've found the one for you! Large kitchen with amazing rural views from the breakfast/sun room. Your gigantic dining table can rest in this area or in the VERY large gorgeous formal dining room.  Having family and friends over forThanksgiving has never been so easy with all of the space for prepping the meal and entertaining during. The gleaming granite and beautiful floors will make you never want to leave! Exit from the breakfast room onto your large composite deck that overlooks one of the most beautiful views in all of Harford County and also glares out at the screened in gazebo, large cabana area, heated in-ground pool with fountains and overflow for built-in hot tub with custom lighting and more! If that's not enough, hang by the horse shoe pits, coy pond or fire pit all included in the 2.83 acres. Underneath the composite deck is a custom built storage area for everything for the pool and lawn maintenance. With five total bedrooms, there's room for your growing family or out of town guests.  The first floor bedroom is currently an over-sized office but can clearly be multi-functional.  Between the gas fireplace, large driveway, 2 car garage, master bathroom garden tub, vaulted ceilings in master, two-story family room, dual zoned heating and A/C, dual electric panels, and whole house generator - WHAT MORE COULD YOU ASK FOR?!? Don't think that this home is \"too far out there\" because it's just 12-15 minutes from Harford Community College and the Arena Club and it's not 20 minutes from Bel Air.Schedule a showing today for this MUST SEE home!",
        "primarydetails": {
            "Beds/Baths": "5/2.1",
            "Interior Sq. Ft": "2,980",
            "Acreage": "2.83",
            "Age": "14",
            "Style": "Colonial",
            "MLS#": "1009919370",
            "Subdivision": "None Available",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$640,000",
        "cdp": "Long Bar Harbor",
        "address": "4011 Baker Avenue, Abingdon",
        "listing": "/listings/301547425396",
        "fulladdress": "4011 Baker Avenue, Abingdon, MD 21009",
        "description": "Designed for water views from every floor this elevated home is everything you would want for waterfront living/entertaining. Master Bedroom loft with additional sitting room with water views. Main lvl bdrms 2 Pellet stoves. Fully fenced yard and large storage shed. Two Year old roof,Large parking pad, multi tiered decks and bulkhead.10,000 lb. boat lift and jet ski lift. No flood ins. required.",
        "primarydetails": {
            "Beds/Baths": "3/3.0",
            "Interior Sq. Ft": "2,298",
            "Acreage": "0.2",
            "Age": "34",
            "Style": "A-Frame",
            "MLS#": "MDHR222710",
            "Subdivision": "Long Bar Harbor",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$626,990",
        "cdp": "Magness Farms",
        "address": "1343 Merlot Drive, Bel Air",
        "listing": "/listings/301584973509",
        "fulladdress": "1343 Merlot Drive, Bel Air, MD 21015-0",
        "description": "K. Hovnanian Homes Magness Farms offers gorgeous TO BE BUILT Colorado w/2 story family room, fireplace, kitchen island plus more in almost 3500 sq ft base size. Customize your features w/ available upgrades. Located in desirable Bel Air with large private homesites, yet close to shopping & 95. Newly released lots selling quickly! Closing cost assistance may be available, See Sales consultant for details. Photo likeness.",
        "primarydetails": {
            "Beds/Baths": "4/2.1",
            "Interior Sq. Ft": "3,434",
            "Acreage": "0.5",
            "Age": "0",
            "Style": "Traditional",
            "MLS#": "MDHR223464",
            "Subdivision": "Magness Farms",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$589,900",
        "cdp": "Hamilton Farms",
        "address": "2452 Thomas Run Road, Bel Air",
        "listing": "/listings/301440615947",
        "fulladdress": "2452 Thomas Run Road, Bel Air, MD 21015-0",
        "description": "ANOTHER BEAUTIFUL HOME IS CURRENTLY UNDER CONSTRUCTION BY PINNACLE DESIGN*ACT NOW & YOU CAN MOVE IN BEFORE THE SUMMER*FEATURING 4 LARGE BEDROOM'S, 3 FULL BATHS, 2 CAR SIDE LOAD GARAGE & OVER 3000 SQ FT OF FINISHED LIVING SPACE*LOADED WITH THE FINEST AMENITIES TO INCLUDE GOURMET KITCHEN, FAMILY ROOM WITH  FIREPLACE, UPPER LEVEL LAUNDRY, MAIN LEVEL DEN & MORE*GEO THERMAL HEAT/AC*BUYER MAY RECEIVE UP TO 15K GEO THERMAL TAX CREDIT*LOCATED ON A BEAUTIFUL 2 ACRE LOT - NO HOME OWNERS ASSOCIATION!",
        "primarydetails": {
            "Beds/Baths": "4/3",
            "Acreage": "2",
            "Age": "0",
            "Style": "Colonial",
            "MLS#": "MDHR221394",
            "Subdivision": "Hamilton Farms",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$629,900",
        "cdp": "Laurel Ridge",
        "address": "2792 Sugar Pine Court, Abingdon",
        "listing": "/listings/301604977491",
        "fulladdress": "2792 Sugar Pine Court, Abingdon, MD 21009",
        "description": "Move In Ready -  NEW COMMUNITY OF LAUREL RIDGE - Stunning 4 bed, 2 1/2 bath in Laurel Ridge. Open floor plan, granite counters, SS appliances, HW floors, formal LR & DR. Family room w/pellet stove. Solarium off kitchen. Master suite w/French doors and sitting area. Master Bath w/dual sink/sep shower. 3 car garage. Gorgeous in ground pool, beautifully landscaped. Too many upgrades to mention.",
        "primarydetails": {
            "Beds/Baths": "4/2.1",
            "Interior Sq. Ft": "4,943",
            "Acreage": "0.22",
            "Age": "3",
            "Style": "Craftsman",
            "MLS#": "MDHR230802",
            "Subdivision": "Laurel Ridge",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$650,000",
        "cdp": null,
        "address": "1339 N Bend Road, Jarrettsville",
        "listing": "/listings/301583062262",
        "fulladdress": "1339 N Bend Road, Jarrettsville, MD 21084-1337",
        "description": "Total of 8 lots ranging from 1 - 12 acres.  Two lots have existing structures that would need to be renovated or torn down.  All lots have wells and percs.  Property is being used for approved hunting so please call if you want to see so the neighbors can be notified,",
        "primarydetails": {
            "Beds/Baths": "0/1.0",
            "Acreage": "35",
            "Age": "2019",
            "Zoning": "AG",
            "MLS#": "MDHR223376"
        }
    },
    {
        "price": "$649,990",
        "cdp": "Magness Farms",
        "address": "1301 Merlot Drive, Bel Air",
        "listing": "/listings/301442306337",
        "fulladdress": "1301 Merlot Drive, Bel Air, MD 21015-6046",
        "description": "Fall move in! K. Hovnanian Homes at Magness Farms brand new Alaska home with many excellent features such as Grand Morning Room Gourmet Kitchen with huge island, Butlers Pantry, Flared stairs! Wonderful open plan. Magness Farms offers large homesites in an ideal location nestled among rolling hills yet convenient to shops, restaurants and historic Bel Air! Easy access to Rt 1, Rt 24 and I-95. Photo Likeness. See sales consultant for details.",
        "primarydetails": {
            "Beds/Baths": "4/3.1",
            "Interior Sq. Ft": "3,420",
            "Acreage": "0.38",
            "Age": "0",
            "Style": "Traditional",
            "MLS#": "MDHR221414",
            "Subdivision": "Magness Farms",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$649,900",
        "cdp": "Fallston",
        "address": "2417 Haddon Hurst Court, Fallston",
        "listing": "/listings/301604622972",
        "fulladdress": "2417 Haddon Hurst Court, Fallston, MD 21047-1378",
        "description": "Beautful 4br/4ba colinal on pictturesque 2 acres in Fallston.",
        "primarydetails": {
            "Beds/Baths": "4/4",
            "Interior Sq. Ft": "5,844",
            "Acreage": "2.06",
            "Age": "26",
            "Style": "Colonial",
            "MLS#": "MDHR230790",
            "Subdivision": "Fallston",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$650,000",
        "cdp": "Open Acres Manor",
        "address": "1112 Janice Court, Joppa",
        "listing": "/listings/301545636610",
        "fulladdress": "1112 Janice Court, Joppa, MD 21085-1112",
        "description": "Nestled in a great neighborhood, this 4 bedroom, 4.5 bath rancher is unlike anything you have seen before! The open style layout of this abundantly spacious home provides plenty of natural light and space for entertaining. With top quality materials and finishes found throughout this one of a kind masterpiece, you'll make even the simplest of task seem luxurious. Do impeccable sun lounges, exquisite spa-like master baths and high-end, luxury appliances sound like something you'd like to start & end your day with? Then please don't miss the rare opportunity to own in Open Acres Manor. This STUNNING home is a MUST SEE!",
        "primarydetails": {
            "Beds/Baths": "4/4.1",
            "Interior Sq. Ft": "7,512",
            "Acreage": "2.02",
            "Age": "34",
            "Style": "Ranch/Rambler",
            "MLS#": "MDHR222684",
            "Subdivision": "Open Acres Manor",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$609,000",
        "cdp": null,
        "address": "3007 Victorias Way, Forest Hill",
        "listing": "/listings/301524688023",
        "fulladdress": "3007 Victorias Way, Forest Hill, MD 21050-1435",
        "description": "GORGEOUS home completely renovated/ remodeled in 2017, including new roof, shutters, insulated energy efficient windows, insulated interior doors, carpet, paint, flooring, and all new energy star appliances. In absolutely pristine condition, this home offers an open floor plan, with wood flooring, crown, and decorative molding throughout. The kitchen has ample counter space with granite countertops, all stainless steel energy star appliances, a huge island, with breakfast bar, high end pendant lighting, dining area with chandelier, and fireplace. Spacious family room, and an additional front room which can be utilized as a separate formal dining room, or den. The second floor offers four large bedrooms, all with walk in closets, or large step in closets. The master bath has a double vanity sink with quartz countertop, jacuzzi soaking tub, and dual head walk in shower. There is an second full bath upstairs, and the fourth bedroom has it's own master bath. Downstairs is a large, unfinished basement with sliding glass doors leading the backyard. The backyard has a large trek deck, perfect for grilling and entertaining. Attached two car garage, and an additional detached heated garage 1.5 stories tall, measuring 42' x 62' with two bay doors, and attic/loft area. Garage contains a 10,000lb 2 post auto lift as well. Additional storage area to the back of the garage that can only be accessed from the outside. Home has two 1,000 lb propane tanks that supply the home and detached garage. Although the basement is unfinished, please note that studs are in place, electric is ran, and the plumbing rough in for a full bath is already in place, so it wouldn't take much to completely finish the space. Seller is motivated, and considering all offers...",
        "primarydetails": {
            "Beds/Baths": "4/3.1",
            "Interior Sq. Ft": "3,842",
            "Acreage": "2.62",
            "Age": "26",
            "Style": "Colonial",
            "MLS#": "MDHR222532",
            "Subdivision": "None Available",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$592,500",
        "cdp": "Leeswood",
        "address": "903 Leeswood Road, Bel Air",
        "listing": "/listings/301544145675",
        "fulladdress": "903 Leeswood Road, Bel Air, MD 21014-2521",
        "description": "Looking for a home offering totally separate In-law unit with two bedroom and two full baths, kitchen and living area? This home, in desirable Leeswood includes two gathering spaces on main level with open, updated kitchen, fabulously finished lower level and upper level with master suite, an additional bedroom with it's own bath. The lower level is tiled with wood look floors, features built in bar and perfect space for viewing your favorite teams and a game room. Park in your two car garage with storage capabilities in detached single car garage. All sited on large level lot.",
        "primarydetails": {
            "Beds/Baths": "4/4.1",
            "Interior Sq. Ft": "5,661",
            "Acreage": "1.07",
            "Age": "48",
            "Style": "Colonial",
            "MLS#": "MDHR222666",
            "Subdivision": "Leeswood",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$599,000",
        "cdp": "Other",
        "address": "2743 Urey Road, White Hall",
        "listing": "/listings/301531516714",
        "fulladdress": "2743 Urey Road, White Hall, MD 21161-9682",
        "description": "Come design your dream home with the award winning builder, Battaglia Homes!!! Pick your floor plan, style and customize it all.  Battaglia Homes provides a unique and comprehensive building experience with our network of professional designers, architects and craftsman who will help guide you to bring your desired lifestyle to reality. Bring your ideas, or use ours.",
        "primarydetails": {
            "Beds/Baths": "/",
            "Acreage": "2.26",
            "Age": "0",
            "Style": "Other",
            "MLS#": "MDHR222608",
            "Subdivision": "Other",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$595,000",
        "cdp": null,
        "address": "207 South Fountain Green Road E, Bel Air",
        "listing": "/listings/300506572831",
        "fulladdress": "207 South Fountain Green Road E, Bel Air, MD 21015",
        "description": "3.9 acres R2",
        "primarydetails": {
            "Beds/Baths": "4/1.0",
            "Interior Sq. Ft": "1,200",
            "Acreage": "3.9",
            "Age": "87",
            "Style": "Bungalow",
            "MLS#": "1002351448",
            "Subdivision": "None Available",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$595,000",
        "cdp": null,
        "address": "1502 S Tollgate Road, Bel Air",
        "listing": "/listings/300866445749",
        "fulladdress": "1502 S Tollgate Road, Bel Air, MD 21015-5840",
        "description": "5.98+/- Acres just outside Bel Air City limits.  Possible sub-dividable property - potential buyers check with Harford County and State offices to determine ability to subdivide property.  Potential buyer to preform their own due diligence.  Also see MLS  1009117042  Brick Rancher on property is sold in as in condition - Needs a little TLC but quite livable.",
        "primarydetails": {
            "Beds/Baths": "0/1.1",
            "Acreage": "5.98",
            "Age": "54",
            "Zoning": "R2",
            "MLS#": "1009910592"
        }
    },
    {
        "price": "$595,000",
        "cdp": null,
        "address": "1502 Tollgate Road S, Bel Air",
        "listing": "/listings/300831309504",
        "fulladdress": "1502 Tollgate Road S, Bel Air, MD 21015",
        "description": "Solid brick rancher located on 5.98 +/- acres just outside Bel Air City limits.  Possible sub-dividable property - check with Harford County for information.  House backs to creek - very serene.  Zoned residential.  Possible investor/builder potential.  Value mostly in the land - house needs TLC but quite livable.   Mostly cleared land - just partly wooded. Also See: MLS 1009910592",
        "primarydetails": {
            "Beds/Baths": "3/2.0",
            "Interior Sq. Ft": "2,094",
            "Acreage": "5.98",
            "Age": "54",
            "Style": "Ranch/Rambler",
            "MLS#": "1009117042",
            "Subdivision": "None Available",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$599,000",
        "cdp": null,
        "address": "2739 Urey Road, White Hall",
        "listing": "/listings/301531497203",
        "fulladdress": "2739 Urey Road, White Hall, MD 21161-9682",
        "description": "Come design your dream home with the award winning builder, Battaglia Homes!!! Pick your floor plan, style and customize it all.  Battaglia Homes provides a unique and comprehensive building experience with our network of professional designers, architects and craftsman who will help guide you to bring your desired lifestyle to reality. Bring your ideas, or use ours.",
        "primarydetails": {
            "Beds/Baths": "/",
            "Acreage": "2.15",
            "Age": "0",
            "Style": "Other",
            "MLS#": "MDHR222606",
            "Subdivision": "None Available",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$599,000",
        "cdp": null,
        "address": "2719 Urey Road, White Hall",
        "listing": "/listings/301531492940",
        "fulladdress": "2719 Urey Road, White Hall, MD 21161-9682",
        "description": "Come design your dream home with the award winning builder, Battaglia Homes!!! Pick your floor plan, style and customize it all.  Battaglia Homes provides a unique and comprehensive building experience with our network of professional designers, architects and craftsman who will help guide you to bring your desired lifestyle to reality. Bring your ideas, or use ours.",
        "primarydetails": {
            "Beds/Baths": "/",
            "Acreage": "2.67",
            "Age": "0",
            "Style": "Other",
            "MLS#": "MDHR222604",
            "Subdivision": "None Available",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$599,900",
        "cdp": null,
        "address": "Gilbert Road, Aberdeen",
        "listing": "/listings/300336880105",
        "fulladdress": "Gilbert Road, Aberdeen, MD 21001",
        "description": "45 Acres located close to Wet Lands Golf course ,   Build your dream home .  Please verify zoning before any offers .",
        "primarydetails": {
            "Beds/Baths": "/",
            "Acreage": "45.57",
            "Zoning": "AG",
            "MLS#": "1000264132",
            "Subdivision": "None Available"
        }
    },
    {
        "price": "$599,900",
        "cdp": null,
        "address": "3823 Salem Church Road, Jarrettsville",
        "listing": "/listings/301613102292",
        "fulladdress": "3823 Salem Church Road, Jarrettsville, MD 21084-1414",
        "description": "Masterfully restored original farmhouse circa 1848.  Refinished hardwood floors throughout all levels. Custom mouldings, beamed ceilings, idealistic front porch.  Kitchen with farmhouse sink, breakfast areas with glorious views, and built-ins.  Walk in closet in master and upstairs laundry.  Timeless tradition kept alive and crafted for today~s living.  Tenant house with 1 car garage, 2 bedrooms, 2 full baths, and private laundry.  3 stall barn with hay loft, tack room, laundry, and office space.  Fenced paddocks, run in shed, and miles of views.  Public record reflects tenant house date, farmhouse dated by previous owners and buyer to verify.  20 mins to Towson and a few quick miles to Four Corners.",
        "primarydetails": {
            "Beds/Baths": "3/3",
            "Interior Sq. Ft": "3,728",
            "Acreage": "4.53",
            "Age": "2001",
            "Style": "Farmhouse/National Folk, Craftsman",
            "MLS#": "MDHR230982",
            "Subdivision": "None Available",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$599,900",
        "cdp": "Fallston",
        "address": "2431 Baldwin Mill Road, Fallston",
        "listing": "/listings/301297656257",
        "fulladdress": "2431 Baldwin Mill Road, Fallston, MD 21047-0",
        "description": "To be built! The photograph shown is a stock photo and not specific to this homesite. Other options and house types available.",
        "primarydetails": {
            "Beds/Baths": "4/2.1",
            "Acreage": "2",
            "Age": "2019",
            "Style": "Colonial",
            "MLS#": "MDHR180320",
            "Subdivision": "Fallston",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$599,900",
        "cdp": "Magness Mill",
        "address": "724 Shady Creek Court, Bel Air",
        "listing": "/listings/301176416886",
        "fulladdress": "724 Shady Creek Court, Bel Air, MD 21015",
        "description": "Almost NEW: Premium lot-Torino model..4 BR/3.5 BA colonial w/wide-plank HW floors.. 9-ft ceilings on main level.. Granite counters, 42\" cabinets & huge island/breakfast bar in kitchen..Stone hearth FP in FR..Covered porch w/ beautiful cathedral wood ceiling-maintenance-free deck w/ stairs to patio..Master suite w/ tray ceiling & sitting room.. Finished LL w/ rec room, full bath & storage..",
        "primarydetails": {
            "Beds/Baths": "4/3.1",
            "Interior Sq. Ft": "5,254",
            "Acreage": "0.18",
            "Age": "3",
            "Style": "Colonial",
            "MLS#": "MDHR162514",
            "Subdivision": "Magness Mill",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$599,900",
        "cdp": "Bulle Rock",
        "address": "517 Risen Star Court, Havre De Grace",
        "listing": "/listings/301502487996",
        "fulladdress": "517 Risen Star Court, Havre De Grace, MD 21078-2699",
        "description": "Welcome home to this stunning Bulle Rock home with luxurious high-end finishes overlooking the Bulle Rock Golf Course.   Entertaining is a dream with this open concept floor plan and over 4300 sq. ft of finished living space.  The Gourmet Kitchen with SS appliances, granite counters( including a wrap-around raised counter), is open to the Great Room featuring a stone gas fireplace, and has sliders to the Screened Porch with million-dollar views.  This is a great place to enjoy your morning coffee or evening happy hours!   The screened porch opens to a Trex deck with stairs down to a fabulous hardscape patio with fire pit.  This home features a total of five Bedroom's, four full and one-half baths (including a main level bedroom and bath), an upper loft overlooking the 2-story foyer, a convenient main level laundry room, and a 2-car garage.   Amenities include upgraded 5\" hardwood floors throughout, and granite countertops in all full  bathrooms.  The fully finished walk-out lower level features a large recreation/party room with a custom bar with granite top, 5th bedroom, full bath and plenty of storage.  Walk out to the hardscape patio which spans the entire back of the house with views of the golf course!   Enjoy the Bulle Rock lifestyle within the gated community with 24 hr. security, which includes world class golf on a Pete Dye designed course, the on-site Gourmet Pub & Grill, social clubs, community events, a spectacular recreation center with a full gym, indoor & outdoor pools, tennis courts and walking trails. Come live where ~Life Imitates Vacation!~",
        "primarydetails": {
            "Beds/Baths": "5/4.1",
            "Interior Sq. Ft": "4,346",
            "Acreage": "0.23",
            "Age": "7",
            "Style": "Colonial",
            "MLS#": "MDHR222262",
            "Subdivision": "Bulle Rock",
            "Design/Type": "Detached"
        }
    },
    {
        "price": "$599,900",
        "cdp": null,
        "address": "3823 Salem Church Road, Jarrettsville",
        "listing": "/listings/301616313995",
        "fulladdress": "3823 Salem Church Road, Jarrettsville, MD 21084-1414",
        "description": "Masterfully restored original farmhouse circa 1848.  Refinished hardwood floors throughout all levels. Custom mouldings, beamed ceilings, idealistic front porch.  Kitchen with farmhouse sink, breakfast areas with glorious views, and built-ins.  Walk in closet in master and upstairs laundry.  Timeless tradition kept alive and crafted for today~s living.  Tenant house with 1 car garage, 2 bedrooms, 2 full baths, and private laundry.  3 stall barn with hay loft, tack room, laundry, and office space.  Fenced paddocks, run in shed, and miles of views.  Public record reflects tenant house date, farmhouse dated by previous owners and buyer to verify.  20 mins to Towson and a few quick miles to Four Corners.",
        "primarydetails": {
            "Beds/Baths": "3/3",
            "Acreage": "4.53",
            "Age": "21",
            "Zoning": "AG",
            "MLS#": "MDHR231050",
            "Subdivision": "None Available",
            "Design/Type": "Detached"
        }
    }
]